#### TextNode Members

---

|  |
| --- |
| TextNode Class   Methods   Properties   See Also |

The  TextNode  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RenderNode  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetFormattedText | Returns an  FormattedText  object that contains text and associated formatting of this TextNode. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BaseDirection | Direction of the base line of the text object in model space. |
| Public property | Color | The color of the text. |
| Public property | FontHeight | Height [ft] of the text font, in model space. |
| Public property | FontName | The name of the text font. |
| Public property | Height | Height [ft] of the area of the text content in model space. |
| Public property | HorizontalAlignment | Indicates default horizontal alignment of the text. |
| Public property | IsBold | Indicates whether the default formatting is set to bold text. |
| Public property | IsItalic | Indicates whether the default formatting is set to italic text. |
| Public property | IsKeptReadable | Indicates text behavior inside a rotated text object. |
| Public property | IsTransparent | Indicates whether the text background is transparent or opaque. |
| Public property | IsUnderlined | Indicates whether the default formatting is set to underlined text. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RenderNode  .) |
| Public property | NodeName | A readable name of the output node. (Inherited from  RenderNode  .) |
| Public property | Position | Position of the text in model coordinates. |
| Public property | TabSize | The size [ft] of the interval between tab stops, in model space. |
| Public property | Text | The content of the text annotation as a plain string stripped of all formatting. |
| Public property | UpDirection | Direction along the vertical axis of letters of the text object in model space. |
| Public property | VerticalAlignment | Indicates default vertical alignment of the text. |
| Public property | Width | Width [ft] of the area of the text content in model space. |
| Public property | WidthScale | Scale applied to the width of the text. |

# See Also

TextNode Class

Autodesk.Revit.DB Namespace